# AreaTagFilter Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaTagFilter Constructor
AreaTagFilter Class See Also
---
Constructs a filter which matches only areas.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public AreaTagFilter()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
AreaTagFilter()
```

# See Also
AreaTagFilter Class
Autodesk.Revit.DB Namespace